# BuiltInFailures.LoadFailures Members (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
BuiltInFailures..::..LoadFailures Members
BuiltInFailures..::..LoadFailures Class Properties See Also
---
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures..::..LoadFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CannotCopyHostedLoad | Can't copy Load based on the Host Element. |
| CannotMirrorHostedLoad | Can't mirror Load based on the Host Element. |
| CannotMirrorLoad | Can't mirror Load because mirror plane is not perpendicular to sketch plane. |
| CannotMoveHostedLoad | Can't move Load based on the Host Element. |
| CannotRotateLoad | Can't rotate Load because rotation axis is not perpendicular to sketch plane. |
| LineLoadAllZero | Line Load can't have all force components and moment components to be zero. |
| PointLoadAllZero | Point Load can't have all force components and moment components to be zero. |

# See Also
BuiltInFailures..::..LoadFailures Class
Autodesk.Revit.DB Namespace